{
  "settings_title": "Configurações",
  "settings_description": "Gerencie suas preferências e informações de emergência.",
  "language_preference_title": "Preferência de Idioma",
  "language_preference_description": "Este aplicativo foi escrito em inglês. A seleção de um idioma abaixo sinaliza sua preferência para o navegador. Se o seu navegador tiver um recurso de tradução integrado (como o do Chrome), ele deverá solicitar a tradução da página.",
  "language_preference_note": "Observação: este recurso depende inteiramente dos recursos e configurações do seu navegador. O aplicativo em si não realiza a tradução.",
  "fallback_location_title": "Localização Alternativa",
  "fallback_location_description": "Esta localização será usada para varreduras de área se o aplicativo não puder acessar o GPS do seu dispositivo.",
  "city_label": "Cidade",
  "state_label": "Estado",
  "zip_code_label": "CEP",
  "ai_config_title": "Configuração de IA",
  "ai_config_description": "Configure sua própria chave de API e modelo Gemini para recursos alimentados por IA, como varredura de área and assistência jurídica.",
  "gemini_api_key_label": "Chave de API Gemini",
  "gemini_api_key_placeholder": "Digite sua chave de API Gemini",
  "gemini_api_key_note": "🔒 Sua chave de API é armazenada com segurança apenas no armazenamento local do seu navegador. Ela nunca sai do seu dispositivo e não pode ser acessada por mais ninguém, incluindo os desenvolvedores do aplicativo.",
  "ai_model_label": "Modelo de IA",
  "emergency_contacts_title": "Contatos de Emergência",
  "emergency_contacts_description": "Esses contatos serão notificados quando você ativar a transmissão de emergência.",
  "contact_name_placeholder": "Nome",
  "contact_phone_placeholder": "Número de Telefone",
  "add_contact_button": "+ Adicionar Contato",
  "about_title": "Sobre",
  "about_description": "O Firewatch é um projeto de código aberto. Você pode encontrar o código-fonte no GitHub.",
  "github_repository_link": "Repositório do Firewatch no GitHub",
  "developed_by_text": "Desenvolvido com assistência de IA por",
  "developer_tagline": "— Soluções de IA personalizadas para desafios de desenvolvimento modernos.",
  "privacy_security_title": "Privacidade e Segurança",
  "privacy_secure_data_title": "🔒 Seus Dados Permanecem Privados",
  "privacy_item_1": "• Todas as chaves de API são armazenadas localmente apenas no armazenamento do seu navegador",
  "privacy_item_2": "• Nenhum dado é enviado para servidores externos, exceto suas chamadas diretas de API para o Google",
  "privacy_item_3": "• Os desenvolvedores de aplicativos não podem acessar sua chave de API ou qualquer informação pessoal",
  "privacy_item_4": "• Todas as gravações e evidências permanecem em seu dispositivo, a menos que você opte por compartilhá-las",
  "save_settings_button": "Salvar Configurações",
  "settings_saved_message": "Configurações salvas com sucesso!"
} 