{
  "settings_title": "Paramètres",
  "settings_description": "Gérez vos préférences et informations d'urgence.",
  "language_preference_title": "Préférence de langue",
  "language_preference_description": "Cette application est rédigée en anglais. La sélection d'une langue ci-dessous signale votre préférence au navigateur. Si votre navigateur dispose d'une fonction de traduction intégrée (comme celle de Chrome), il devrait vous proposer de traduire la page.",
  "language_preference_note": "Remarque : Cette fonctionnalité dépend entièrement des capacités et des paramètres de votre navigateur. L'application elle-même n'effectue pas de traduction.",
  "fallback_location_title": "Emplacement de secours",
  "fallback_location_description": "Cet emplacement sera utilisé pour les analyses de zone si l'application ne peut pas accéder au GPS de votre appareil.",
  "city_label": "Ville",
  "state_label": "État",
  "zip_code_label": "Code postal",
  "ai_config_title": "Configuration de l'IA",
  "ai_config_description": "Configurez votre propre clé API Gemini et votre modèle pour les fonctionnalités basées sur l'IA telles que l'analyse de zone et l'assistance juridique.",
  "gemini_api_key_label": "Clé API Gemini",
  "gemini_api_key_placeholder": "Entrez votre clé API Gemini",
  "gemini_api_key_note": "🔒 Votre clé API est stockée en toute sécurité uniquement dans le stockage local de votre navigateur. Elle ne quitte jamais votre appareil et ne peut être consultée par personne d'autre, y compris les développeurs de l'application.",
  "ai_model_label": "Modèle d'IA",
  "emergency_contacts_title": "Contacts d'urgence",
  "emergency_contacts_description": "Ces contacts seront avertis lorsque vous activerez la diffusion d'urgence.",
  "contact_name_placeholder": "Nom",
  "contact_phone_placeholder": "Numéro de téléphone",
  "add_contact_button": "+ Ajouter un contact",
  "about_title": "À propos",
  "about_description": "Firewatch est un projet open source. Vous pouvez trouver le code source sur GitHub.",
  "github_repository_link": "Dépôt GitHub de Firewatch",
  "developed_by_text": "Développé avec l'assistance de l'IA par",
  "developer_tagline": "— Des solutions d'IA personnalisées pour les défis de développement modernes.",
  "privacy_security_title": "Confidentialité et sécurité",
  "privacy_secure_data_title": "🔒 Vos données restent privées",
  "privacy_item_1": "• Toutes les clés API sont stockées localement dans le stockage de votre navigateur uniquement",
  "privacy_item_2": "• Aucune donnée n'est envoyée à des serveurs externes, à l'exception de vos appels directs à l'API de Google",
  "privacy_item_3": "• Les développeurs d'applications ne peuvent pas accéder à votre clé API ni à aucune information personnelle",
  "privacy_item_4": "• Tous les enregistrements et preuves restent sur votre appareil, sauf si vous choisissez de les partager",
  "save_settings_button": "Enregistrer les paramètres",
  "settings_saved_message": "Paramètres enregistrés avec succès !"
} 