{
  "settings_title": "Cài đặt",
  "settings_description": "Quản lý tùy chọn và thông tin khẩn cấp của bạn.",
  "language_preference_title": "Tùy chọn ngôn ngữ",
  "language_preference_description": "Ứng dụng này được viết bằng tiếng Anh. Việc chọn một ngôn ngữ bên dưới sẽ báo hiệu tùy chọn của bạn cho trình duyệt. Nếu trình duyệt của bạn có tính năng dịch tích hợp (như của Chrome), nó sẽ nhắc bạn dịch trang.",
  "language_preference_note": "Lưu ý: Tính năng này hoàn toàn phụ thuộc vào khả năng và cài đặt của trình duyệt của bạn. Bản thân ứng dụng không thực hiện dịch.",
  "fallback_location_title": "Vị trí dự phòng",
  "fallback_location_description": "Vị trí này sẽ được sử dụng để quét khu vực nếu ứng dụng không thể truy cập GPS của thiết bị của bạn.",
  "city_label": "Thành phố",
  "state_label": "Tiểu bang",
  "zip_code_label": "Mã ZIP",
  "ai_config_title": "Cấu hình AI",
  "ai_config_description": "Định cấu hình khóa API Gemini và mô hình của riêng bạn cho các tính năng do AI cung cấp như quét khu vực và hỗ trợ pháp lý.",
  "gemini_api_key_label": "Khóa API Gemini",
  "gemini_api_key_placeholder": "Nhập khóa API Gemini của bạn",
  "gemini_api_key_note": "🔒 Khóa API của bạn chỉ được lưu trữ an toàn trong bộ nhớ cục bộ của trình duyệt. Nó không bao giờ rời khỏi thiết bị của bạn và không ai khác có thể truy cập được, kể cả các nhà phát triển ứng dụng.",
  "ai_model_label": "Mô hình AI",
  "emergency_contacts_title": "Liên hệ khẩn cấp",
  "emergency_contacts_description": "Các liên hệ này sẽ được thông báo khi bạn kích hoạt chương trình phát sóng khẩn cấp.",
  "contact_name_placeholder": "Tên",
  "contact_phone_placeholder": "Số điện thoại",
  "add_contact_button": "+ Thêm liên hệ",
  "about_title": "Giới thiệu",
  "about_description": "Firewatch là một dự án mã nguồn mở. Bạn có thể tìm thấy mã nguồn trên GitHub.",
  "github_repository_link": "Kho lưu trữ Firewatch GitHub",
  "developed_by_text": "Được phát triển với sự hỗ trợ của AI bởi",
  "developer_tagline": "- Các giải pháp AI tùy chỉnh cho các thách thức phát triển hiện đại.",
  "privacy_security_title": "Quyền riêng tư và bảo mật",
  "privacy_secure_data_title": "🔒 Dữ liệu của bạn được giữ riêng tư",
  "privacy_item_1": "• Tất cả các khóa API chỉ được lưu trữ cục bộ trong bộ nhớ của trình duyệt của bạn",
  "privacy_item_2": "• Không có dữ liệu nào được gửi đến các máy chủ bên ngoài ngoại trừ các lệnh gọi API trực tiếp của bạn tới Google",
  "privacy_item_3": "• Các nhà phát triển ứng dụng không thể truy cập khóa API của bạn hoặc bất kỳ thông tin cá nhân nào",
  "privacy_item_4": "• Tất cả các bản ghi và bằng chứng vẫn còn trên thiết bị của bạn trừ khi bạn chọn chia sẻ chúng",
  "save_settings_button": "Lưu cài đặt",
  "settings_saved_message": "Cài đặt đã được lưu thành công!"
} 