{
  "settings_title": "Mga Setting",
  "settings_description": "Pamahalaan ang iyong mga kagustuhan at impormasyon sa emergency.",
  "language_preference_title": "Kagustuhan sa Wika",
  "language_preference_description": "Ang app na ito ay nakasulat sa Ingles. Ang pagpili ng wika sa ibaba ay nagpapahiwatig ng iyong kagustuhan sa browser. Kung ang iyong browser ay may built-in na tampok sa pagsasalin (tulad ng sa Chrome), dapat kang i-prompt na isalin ang pahina.",
  "language_preference_note": "Tandaan: Ang tampok na ito ay ganap na nakasalalay sa mga kakayahan at setting ng iyong browser. Ang app mismo ay hindi nagsasagawa ng pagsasalin.",
  "fallback_location_title": "Lokasyon ng Fallback",
  "fallback_location_description": "Gagamitin ang lokasyong ito para sa mga pag-scan ng lugar kung hindi ma-access ng app ang GPS ng iyong aparato.",
  "city_label": "Lungsod",
  "state_label": "Estado",
  "zip_code_label": "Zip Code",
  "ai_config_title": "Configuration ng AI",
  "ai_config_description": "I-configure ang iyong sariling Gemini API key at modelo para sa mga tampok na pinapagana ng AI tulad ng pag-scan ng lugar at tulong sa batas.",
  "gemini_api_key_label": "Gemini API Key",
  "gemini_api_key_placeholder": "Ipasok ang iyong Gemini API key",
  "gemini_api_key_note": "🔒 Ang iyong API key ay ligtas na nakaimbak lamang sa lokal na imbakan ng iyong browser. Hindi ito kailanman umaalis sa iyong aparato at hindi maaaring ma-access ng sinuman, kabilang ang mga developer ng app.",
  "ai_model_label": "Modelo ng AI",
  "emergency_contacts_title": "Mga Contact sa Emergency",
  "emergency_contacts_description": "Aabisuhan ang mga contact na ito kapag binuksan mo ang emergency broadcast.",
  "contact_name_placeholder": "Pangalan",
  "contact_phone_placeholder": "Numero ng Telepono",
  "add_contact_button": "+ Magdagdag ng Contact",
  "about_title": "Tungkol sa",
  "about_description": "Ang Firewatch ay isang proyektong open-source. Maaari mong mahanap ang source code sa GitHub.",
  "github_repository_link": "Repositoryo ng Firewatch sa GitHub",
  "developed_by_text": "Binuo sa tulong ng AI ng",
  "developer_tagline": "— Pasadyang mga solusyon sa AI para sa mga modernong hamon sa pag-unlad.",
  "privacy_security_title": "Pagkapribado at Seguridad",
  "privacy_secure_data_title": "🔒 Mananatiling Pribado ang Iyong Data",
  "privacy_item_1": "• Lahat ng mga API key ay lokal na nakaimbak lamang sa imbakan ng iyong browser",
  "privacy_item_2": "• Walang data na ipinapadala sa mga panlabas na server maliban sa iyong mga direktang tawag sa API sa Google",
  "privacy_item_3": "• Hindi ma-access ng mga developer ng app ang iyong API key o anumang personal na impormasyon",
  "privacy_item_4": "• Lahat ng mga pag-record at ebidensya ay mananatili sa iyong aparato maliban kung pipiliin mong ibahagi ang mga ito",
  "save_settings_button": "I-save ang Mga Setting",
  "settings_saved_message": "Matagumpay na na-save ang mga setting!"
} 