{
  "settings_title": "Configuración",
  "settings_description": "Administra tus preferencias e información de emergencia.",
  "language_preference_title": "Preferencia de Idioma",
  "language_preference_description": "Esta aplicación está escrita en inglés. Al seleccionar un idioma a continuación, le indicas tu preferencia al navegador. Si tu navegador tiene una función de traducción incorporada (como la de Chrome), debería pedirte que traduzcas la página.",
  "language_preference_note": "Nota: Esta función depende completamente de las capacidades y configuración de tu navegador. La aplicación en sí no realiza la traducción.",
  "fallback_location_title": "Ubicación de Respaldo",
  "fallback_location_description": "Esta ubicación se usará para los escaneos de área si la aplicación no puede acceder al GPS de tu dispositivo.",
  "city_label": "Ciudad",
  "state_label": "Estado",
  "zip_code_label": "Código Postal",
  "ai_config_title": "Configuración de IA",
  "ai_config_description": "Configura tu propia clave de API de Gemini y modelo para funciones impulsadas por IA como el escaneo de área y la asistencia legal.",
  "gemini_api_key_label": "Clave de API de Gemini",
  "gemini_api_key_placeholder": "Ingresa tu clave de API de Gemini",
  "gemini_api_key_note": "🔒 Tu clave de API se almacena de forma segura solo en el almacenamiento local de tu navegador. Nunca sale de tu dispositivo y no puede ser accedida por nadie más, incluidos los desarrolladores de la aplicación.",
  "ai_model_label": "Modelo de IA",
  "emergency_contacts_title": "Contactos de Emergencia",
  "emergency_contacts_description": "Estos contactos serán notificados cuando actives la transmisión de emergencia.",
  "contact_name_placeholder": "Nombre",
  "contact_phone_placeholder": "Número de Teléfono",
  "add_contact_button": "+ Agregar Contacto",
  "about_title": "Acerca de",
  "about_description": "Firewatch es un proyecto de código abierto. Puedes encontrar el código fuente en GitHub.",
  "github_repository_link": "Repositorio de Firewatch en GitHub",
  "developed_by_text": "Desarrollado con asistencia de IA por",
  "developer_tagline": "— Soluciones de IA personalizadas para desafíos de desarrollo modernos.",
  "privacy_security_title": "Privacidad y Seguridad",
  "privacy_secure_data_title": "🔒 Tus Datos Permanecen Privados",
  "privacy_item_1": "• Todas las claves de API se almacenan localmente solo en el almacenamiento de tu navegador",
  "privacy_item_2": "• No se envían datos a servidores externos, excepto tus llamadas directas a la API de Google",
  "privacy_item_3": "• Los desarrolladores de la aplicación no pueden acceder a tu clave de API ni a ninguna información personal",
  "privacy_item_4": "• Todas las grabaciones y pruebas permanecen en tu dispositivo a menos que elijas compartirlas",
  "save_settings_button": "Guardar Configuración",
  "settings_saved_message": "¡Configuración guardada exitosamente!"
} 